{
  "profile": {
    "name": "Elwalid Ben Hariz",
    "title": "Étudiant en LBC / Business Intelligence",
    "location": "Tunisie",
    "email": "benharizwalid1@gmail.com",
    "linkedin": "https://www.linkedin.com/in/elwalid-ben-hariz-83457b396/",
    "github": "https://github.com/benharizwalid1-lgtm"
  },
  "bio": {
    "serious": "Étudiant en LBC / Business Intelligence et informatique de gestion, intéressé par les systèmes d’information, l’analyse des données et le développement web. Sérieux, motivé et curieux, je développe progressivement mes compétences techniques à travers des projets académiques et personnels.",
    "playful": "Étudiant le jour, curieux du numérique la nuit. J’aime comprendre comment les systèmes fonctionnent, analyser les données et transformer les idées en solutions concrètes (avec ou sans café ☕)."
  },
  "values": [
    {
      "name": "Curiosité",
      "serious": "Volonté constante d’apprendre et de découvrir de nouveaux outils liés aux systèmes d’information et à la Business Intelligence.",
      "playful": "Je suis ce genre d’étudiant qui explore la documentation par curiosité."
    },
    {
      "name": "Adaptabilité",
      "serious": "Capacité à m’adapter à de nouveaux environnements, outils et méthodes de travail.",
      "playful": "Nouvelle technologie ? Nouveau défi ? J’aime apprendre."
    },
    {
      "name": "Rigueur",
      "serious": "Approche structurée dans le travail académique et les projets pratiques.",
      "playful": "Un esprit organisé, même quand le code ne l’est pas encore."
    }
  ],
  "skills": [
    {
      "name": "HTML / CSS",
      "category": "Web",
      "level": 70,
      "serious": "Connaissances solides en HTML et CSS pour la création d'interfaces web simples et responsives.",
      "playful": "Faire du propre et du lisible, c'est déjà un bon début.",
      "image": "/skills/htmlcss.webp"
    },
    {
      "name": "JavaScript",
      "category": "Web",
      "level": 60,
      "serious": "Bases en JavaScript pour ajouter de l'interactivité aux applications web.",
      "playful": "Encore en apprentissage, mais chaque script est un pas en avant.",
      "image": "/skills/js.webp"
    },
    {
      "name": "React",
      "category": "Frontend",
      "level": 55,
      "serious": "Notions de base en React acquises à travers des projets personnels et d'apprentissage.",
      "playful": "Les composants, ça commence à devenir plus clair.",
      "image": "/skills/react.webp"
    },
    {
      "name": "Tailwind",
      "category": "Frontend",
      "level": 55,
      "serious": "Maîtrise des classes utilitaires de base de Tailwind CSS pour créer des interfaces modernes, responsives et bien structurées.",
      "playful": "Plus besoin d’écrire du CSS à la main, les classes Tailwind font le travail ",
      "image": "/skills/tailwind.webp"
    },
    {
      "name": "Node.js",
      "category": "Backend",
      "level": 50,
      "serious": "Bases en Node.js pour le développement côté serveur et la création d'APIs.",
      "playful": "JavaScript partout, même côté serveur.",
      "image": "/skills/node.webp"
    },
    {
      "name": "SQL",
      "category": "Base de données",
      "level": 65,
      "serious": "Requêtes SQL fondamentales pour l'exploitation de bases de données relationnelles.",
      "playful": "SELECT, JOIN… et un peu de logique.",
      "image": "/skills/mysql.webp"
    },
    {
      "name": "Git / GitHub",
      "category": "Outils",
      "level": 60,
      "serious": "Utilisation de Git pour la gestion de versions dans un cadre académique.",
      "playful": "Commit, push… et parfois corriger.",
      "image": "/skills/github.webp"
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "MYAPP – Application de gestion de caisses",
      "context": "Projet académique / personnel",
      "objective": "Analyser et comparer les méthodes de gestion de caisses utilisées par les commerçants afin de faciliter la prise de décision et la digitalisation des processus.",
      "role": "Étudiant – Conception, développement et analyse des données",
      "technologies": [
        "react native",
        "expo",
        "firebase",
        "tailwind"
      ],
      "serious": "MYAPP centralise et structure les données liées aux pratiques de gestion de caisses, permettant d’évaluer l’efficacité des différentes méthodes et de mettre en évidence les limites des solutions traditionnelles par rapport aux outils numériques.",
      "playful": "Un projet interactif qui m’a permis de transformer l’analyse théorique des pratiques commerciales en une application concrète et utile pour les étudiants, chercheurs et professionnels.",
      "app_link": "https://expo.dev/accounts/walidbenhariz/projects/myApp/builds/13128b02-7af2-4ba1-93e6-304d82184d2b"
    },
    {
      "id": 2,
      "title": "Portfolio personnel",
      "context": "Projet personnel",
      "objective": "Présenter mon profil académique et mes compétences",
      "role": "Étudiant – Conception",
      "technologies": [
        "react",
        "tailwind",
        "vite",
        "typescript"
      ],
      "serious": "Portfolio réalisé pour présenter mon parcours, mes compétences et mes projets.",
      "playful": "Mon espace personnel sur le web.",
      "portfolio_link": "#"
    }
  ],
  "responses": {
    "greeting": {
      "serious": "Bonjour, je suis l’assistant IA du portfolio de Walid. Comment puis-je vous aider à découvrir son profil académique ?",
      "playful": "Salut 👋 Je suis l’assistant du portfolio de Walid. Curieux d’en savoir plus ?"
    },
    "unknown": {
      "serious": "Je n’ai pas d’information précise sur ce sujet. N’hésitez pas à contacter Walid directement.",
      "playful": "Bonne question ! Walid sera ravi d’en discuter avec vous."
    }
  }
}